## 16.1.1 Pandas

Pandas is an open source Python library mainly designed for data analysis. Need of pandas came from analyzing data which provides data processing, extraction, and manipulation.

The original website describes it as:
“pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.”
-https://pandas.pydata.org/

### Basics of  pandas

Pandas is providing two important data structure which we should know: Series and DataFrame. A Series is a one-dimensional array containing an array of data and an associated index. The simplest Series is formed from only an single array of data, while dataFrame represents a tabular, spreadsheet-like data structure contains more than one columns, each of which can be a different data type.

## 16.1.2 file Read Write operation

In [ ]:
import numpy as np
import pandas as pd # You can install pandas using pip install pandas or using conda install pandas
np.set_printoptions(precision=4)

In [ ]:
# Reading csv files
import pandas as pd

draft1 = pd.read_csv('example_files/ex1.csv')    # Supply the file name (path)

draft1.head(4)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
# Reading tsv files
draft2 = pd.read_table('example_files/test.tsv')  # Read a tsv into a DataFrame

draft2.head()

        test   test test.1 test.2 test.3
sudh    sudh   sudh   sudh   sudh   sudh
kumar  kumar  kumar  kumar  kumar  kumar

In [ ]:
df = pd.read_csv('example_files/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
# Another way of reading csv file using read_table and providing sep as a ","
pd.read_table('example_files/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
# Reading csv file without printig headers
pd.read_csv('example_files/ex2.csv', header=None)
# a b c d column/header will not print

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [ ]:
# Changing column names by providing names parameter
df =pd.read_csv('example_files/ex2.csv', names=['asdfdsfs','fsdf', 'b', 'c', 'sudh', 'message'])
df

   asdfdsfs  fsdf   b   c   sudh  message
0         1     2   3   4  hello      NaN
1         5     6   7   8  world      NaN
2         9    10  11  12    foo      NaN

In [ ]:
# Here number of columns is more than one hence datatype will be pandas Dataframe, if single column then it will be pandas series, which we will look later on.
type(df)

pandas.core.frame.DataFrame

In [ ]:
# Use of index_col to use as the row labels/indexes of the DataFrame 
parsed = pd.read_csv('example_files/csv_mindex.csv',
                     index_col=['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [ ]:
#!cat example_files/ex4.csv #(To check the content of the file)
pd.read_csv('example_files/ex4.csv', skiprows=[0,2,3]) # Skip rows of index 0,2,3

'get-content' is not recognized as an internal or external command,
operable program or batch file.

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
# !cat example_files/ex5.csv #(To check the content of the file)
result = pd.read_csv('example_files/ex5.csv')
result
pd.isnull(result) # It will check for null values

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [ ]:
result = pd.read_csv('example_files/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
draft3 = pd.read_excel('example_files/Store_Sales_Data.xlsx',sheet_name = 'Returns') # Name of sheet to read from for excel file

draft3.head(6)

   Order ID    Status
0        65  Returned
1       612  Returned
2       614  Returned
3       678  Returned
4       710  Returned
5       740  Returned

In [ ]:
url = "http://www.basketball-reference.com/leagues/NBA_2015_totals.html"

BB_data = pd.read_html(url)         # Read data from the specified html url through read_html

BB_data[0].iloc[:, 0:20].head(5)      # Check 5 rows (10 columns only)

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,FG%,3P,3PA,3P%,2P,2PA,2P%,eFG%,FT,FTA
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,.459,18,60,.300,134,271,.494,.486,76,97
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,.407,10,25,.400,25,61,.410,.465,14,23
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,.544,0,2,.000,217,397,.547,.544,103,205
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,.432,0,0,NaN,19,44,.432,.432,22,38
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,.424,118,333,.354,257,551,.466,.491,167,198

In [ ]:
# Reading csv titanic file
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')

In [ ]:
titanic_train.head(10) # Print first 10 rows using head

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [ ]:
titanic_train[["Name","Pclass"]].head() # Only printing two columns Name & PClass

                                                Name  Pclass
0                            Braund, Mr. Owen Harris       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2                             Heikkinen, Miss. Laina       3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
4                           Allen, Mr. William Henry       3

In [ ]:
# dtypes can give the type of columns
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [ ]:
pd.options.display.max_rows = 10 # Setting max row as 10 to be display

In [ ]:
result = pd.read_csv('example_files/ex6.csv')
result # It will show 10 rows as we have defined max_rows as 10

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [ ]:
pd.read_csv('example_files/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [ ]:
chunk = pd.read_csv('example_files/ex6.csv', chunksize=1000)
chunk

Writing Data to Text Format

In [ ]:
data = pd.read_csv('example_files/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [ ]:
data.to_csv('example_files/out.csv') # Saving data to csv using to_csv
# !cat example_files/out.csv #(To check the content of the file)

In [ ]:
import sys
data.to_csv('example_files/out1.csv', sep='@') # Saving to csv with sep as a "@"

In [ ]:
data.to_csv(sys.stdout, na_rep='NULL') # replacing na values with NULL

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [ ]:
data.to_csv('example_files/out2.csv', index=False, header=False) # Giving index and header as a false

In [ ]:
data.to_csv('example_files/out3.csv', index=False, columns=['a', 'b', 'c']) # Giving different column names
# All the methods we use while reading csv, same we can use while saving data to csv

In [ ]:
# Pandas with date 
dates = pd.date_range('1/1/2000', periods=7) # We can define date using pandas date_range by specifying periods
ts = pd.Series(np.arange(7), index=dates) # Creating pandas series and giving index as a dates which we defined earlier
ts.to_csv('example_files/tseries.csv') # saving csv file into tseries.csv
# !cat example_files/tseries.csv
ts # Here index will be date

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

### Working with Delimited Formats

In [ ]:
import csv
f = open('example_files/ex7.csv') # Opening csv file using open file method

reader = csv.reader(f)
reader

In [ ]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [ ]:
with open('example_files/ex7.csv') as f: # Opening file using with. these we have seen in our file lecture
    lines = list(csv.reader(f))

In [ ]:
header, values = lines[0], lines[1:]

In [ ]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

### JSON Data

JSON (JavaScript Object Notation) is the standard data type format 
for sending data by HTTP request between client/server or any other applications. It is
a much more powerful than CSV.

In [ ]:
# Json as a string
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [ ]:
import json
result = json.loads(obj) # COnvert json like string to json object using json.loads() method
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [ ]:
asjson = json.dumps(result) # Again json to string can be convert using json.dumps()

In [ ]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age','pets']) # Converting json to pandas dataframe
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [ ]:
!cat example_files/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [ ]:
data = pd.read_json('example_files/example.json') # Reading json file using read_json method
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [ ]:
print(data.to_json())
print(data.to_json(orient='records'))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

### XML and HTML: Web Scraping

In [ ]:
tables = pd.read_html('example_files/fdic_failed_bank_list.html') # Reading html file using read_html
len(tables) , tables

(1,
 [                             Bank Name             City  ST   CERT  \
  0                          Allied Bank         Mulberry  AR     91
  1         The Woodbury Banking Company         Woodbury  GA  11297
  2               First CornerStone Bank  King of Prussia  PA  35312
  3                   Trust Company Bank          Memphis  TN   9956
  4           North Milwaukee State Bank        Milwaukee  WI  20364
  ..                                 ...              ...  ..    ...
  542                 Superior Bank, FSB         Hinsdale  IL  32646
  543                Malta National Bank            Malta  OH   6629
  544    First Alliance Bank & Trust Co.       Manchester  NH  34264
  545  National State Bank of Metropolis       Metropolis  IL   3815
  546                   Bank of Honolulu         Honolulu  HI  21029

                     Acquiring Institution        Closing Date  \
  0                           Today's Bank  September 23, 2016
  1                            United Bank     August 19, 2016
  2    First-Citizens Bank & Trust Company         May 6, 2016
  3             The Bank of Fayette County      April 29, 2016
  4    First-Citizens Bank & Trust Company      March 11, 2016
  ..                                   ...                 ...
  542                Superior Federal, FSB       July 27, 2001
  543                    North Valley Bank         May 3, 2001
  544  Southern New Hampshire Bank & Trust    February 2, 2001
  545              Banterra Bank of Marion   December 14, 2000
  546                   Bank of the Orient    October 13, 2000

            Updated Date
  0    November 17, 2016
  1    November 17, 2016
  2    September 6, 2016
  3    September 6, 2016
  4        June 16, 2016
  ..                 ...
  542    August 19, 2014
  543  November 18, 2002
  544  February 18, 2003
  545     March 17, 2005
  546     March 17, 2005

  [547 rows x 7 columns]])

In [ ]:
failures = tables[0]
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [ ]:
close_timestamps = pd.to_datetime(failures['Closing Date']) # converting to datetimecolumn to pandas datetime
close_timestamps.dt.year.value_counts() # Here value_counts will give no of counts for year
#close_timestamps

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

### Binary Data Formats

To store data in binary format is using Python’s builtin
pickle module. However, alterante methods like HDF5 available, which we will see later on in this section.

In [ ]:
frame = pd.read_csv('example_files/ex1.csv')
frame
frame.to_pickle('example_files/frame_pickle')

In [ ]:
pd.read_pickle('example_files/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [ ]:
# !rm example_files/frame_pickle

### Using HDF5 Format

In [ ]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5') # Using H5 file
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [ ]:
store['obj1']

           a
0   0.183873
1  -0.520546
2   1.533495
3  -0.348902
4  -0.779472
..       ...
95  1.394087
96  0.328682
97  0.434346
98 -1.188121
99  0.368638

[100 rows x 1 columns]

In [ ]:
store.put('obj2', frame, format='table')
store.select('obj2', where=['index >= 10 and index <= 15'])
store.close()

## 16.1.3 Web APIs

In [ ]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url) # Fetch the data from the url using requests library, other alternate libs are available like urllib
resp

In [ ]:
data = resp.json() # Converting reponse into json format
data[2]['user']

{'login': 'zanwar369',
 'id': 30016993,
 'node_id': 'MDQ6VXNlcjMwMDE2OTkz',
 'avatar_url': 'https://avatars3.githubusercontent.com/u/30016993?v=4',
 'gravatar_id': '',
 'url': 'https://api.github.com/users/zanwar369',
 'html_url': 'https://github.com/zanwar369',
 'followers_url': 'https://api.github.com/users/zanwar369/followers',
 'following_url': 'https://api.github.com/users/zanwar369/following{/other_user}',
 'gists_url': 'https://api.github.com/users/zanwar369/gists{/gist_id}',
 'starred_url': 'https://api.github.com/users/zanwar369/starred{/owner}{/repo}',
 'subscriptions_url': 'https://api.github.com/users/zanwar369/subscriptions',
 'organizations_url': 'https://api.github.com/users/zanwar369/orgs',
 'repos_url': 'https://api.github.com/users/zanwar369/repos',
 'events_url': 'https://api.github.com/users/zanwar369/events{/privacy}',
 'received_events_url': 'https://api.github.com/users/zanwar369/received_events',
 'type': 'User',
 'site_admin': False}

In [ ]:
# converting response into pandas dataframe
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues

,number,title,labels,state
0,35618,tp_print is deprecated error,[],open
1,35617,Backport PR #35473 on branch 1.1.x (REGR: Fix ...,[],open
2,35616,QST:TypeError: sum() got an unexpected keyword...,"[{'id': 1954720290, 'node_id': 'MDU6TGFiZWwxOT...",open
3,35614,ENH: Make Series.explode work for sets,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
4,35613,REF: use consistent pattern in tslibs.vectorized,"[{'id': 127681, 'node_id': 'MDU6TGFiZWwxMjc2OD...",open
...,...,...,...,...
25,35569,QST: Howto write a custom DateOffset,"[{'id': 53181044, 'node_id': 'MDU6TGFiZWw1MzE4...",open
26,35568,DOC: add type BinaryIO to path param #35505,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
27,35566,BUG: corrupted SAS datasets retain file handles,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,35565,different behaviour of df.isin() in 1.0.5/1.1....,"[{'id': 57296398, 'node_id': 'MDU6TGFiZWw1NzI5...",open
29,35564,BUG:df.sort_values() disturb the order of valu...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open

## 16.1.4 Interacting with Databases

In [ ]:
# We will see about database in more detail later in this course.
import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database4.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists test")
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata2.sqlite')
con.execute(query)
con.commit()

In [ ]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

In [ ]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [ ]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description]) # Fetching data from database and convert into pandas dataframe

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [ ]:
#!/usr/bin/python

import sqlite3
#connecting with the database.
db = sqlite3.connect("my_database5.db")
# Drop table if it already exist using execute() method.
db.execute("drop table if exists grades1")
# Create table as per requirement
db.execute("create table grades1(id int, name text, score int)")
#inserting values inside the created table
db.execute("insert into grades1(id, name, score) values(101, 'John',99 )")
db.execute("insert into grades1(id, name, score) values(102, 'Gary',90 )")
db.execute("insert into grades1(id, name, score) values(103, 'James', 80 )")
db.execute("insert into grades1(id, name, score) values(104, 'Cathy', 85 )")
db.execute("insert into grades1(id, name, score) values(105, 'Kris',95 )")

In [ ]:
db.commit()

In [ ]:
results = db.execute("select * from grades1 order by id")
for row in results:
    print((row))
print("-" * 60 )

(101, 'John', 99)
(102, 'Gary', 90)
(103, 'James', 80)
(104, 'Cathy', 85)
(105, 'Kris', 95)
------------------------------------------------------------

In [ ]:
results = db.execute("select * from grades1 where name = 'Gary' ")
for row in results: print(row)
print("-"* 60 )

(102, 'Gary', 90)
------------------------------------------------------------

In [ ]:
results = db.execute("select * from grades1 where score >= 90 ")
for row in results:
    print(row)
print("-" * 60 )

(101, 'John', 99)
(102, 'Gary', 90)
(105, 'Kris', 95)
------------------------------------------------------------

In [ ]:
results = db.execute("select name, score from grades1 order by score desc ")
for row in results:
    print(row)
print("-" * 60 )

('John', 99)
('Kris', 95)
('Gary', 90)
('Cathy', 85)
('James', 80)
------------------------------------------------------------

In [ ]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)
print("-" * 60 )

('James', 80)
('Cathy', 85)
('Gary', 90)
('Kris', 95)
('John', 99)
------------------------------------------------------------

In [ ]:
results = db.execute("select name, score from grades1 order by score")
for row in results:
    print(row)

('James', 80)
('Cathy', 85)
('Gary', 90)
('Kris', 95)
('John', 99)